iarsystems/ewarm-toshiba-example-projects/TMPM4GR/Libraries/TMPM4GN.h
/**
  * @brief Finite Impulse Response
  */
typedef struct
{
  __IO uint32_t START;             /*!< FIR Start Register                           */
  __IO uint32_t CTRL;              /*!< FIR Control Register                         */
  __IO uint32_t INITIALIZE;        /*!< FIR Initialize Register                      */
  __IO uint32_t INITDATA;          /*!< FIR Init data Register                       */
  __IO uint32_t INTEN;             /*!< FIR Interrupt Enable Register                */
  __IO uint32_t DMAEN;             /*!< FIR DMA Enable Register                      */
  __IO uint32_t RAWINTSTAT;        /*!< FIR Raw Interrupt Status Register            */
  __I  uint32_t SEQSTAT;           /*!< FIR Sequencer Status Register                */
  __IO uint32_t DBUFWPTR;          /*!< FIR Data Buffer Write Pointer Register       */
  __IO uint32_t DBUFRPTR;          /*!< FIR Data Buffer Read Pointer Register        */
       uint32_t RESERVED0[2];
  __IO uint32_t IDATA;             /*!< FIR Input Data Register                      */
  __I  uint32_t ODATA;             /*!< FIR Output Data Register                     */
       uint32_t RESERVED1[2];
  __IO uint32_t COEF0;             /*!< FIR Coefficient Register0                    */
  __IO uint32_t COEF1;             /*!< FIR Coefficient Register1                    */
  __IO uint32_t COEF2;             /*!< FIR Coefficient Register2                    */
  __IO uint32_t COEF3;             /*!< FIR Coefficient Register3                    */
  __IO uint32_t COEF4;             /*!< FIR Coefficient Register4                    */
  __IO uint32_t COEF5;             /*!< FIR Coefficient Register5                    */
  __IO uint32_t COEF6;             /*!< FIR Coefficient Register6                    */
  __IO uint32_t COEF7;             /*!< FIR Coefficient Register7                    */
  __IO uint32_t COEF8;             /*!< FIR Coefficient Register8                    */
  __IO uint32_t COEF9;             /*!< FIR Coefficient Register9                    */
  __IO uint32_t COEF10;            /*!< FIR Coefficient Register10                   */
  __IO uint32_t COEF11;            /*!< FIR Coefficient Register11                   */
  __IO uint32_t COEF12;            /*!< FIR Coefficient Register12                   */
  __IO uint32_t COEF13;            /*!< FIR Coefficient Register13                   */
  __IO uint32_t COEF14;            /*!< FIR Coefficient Register14                   */
  __IO uint32_t COEF15;            /*!< FIR Coefficient Register15                   */
  __IO uint32_t COEF16;            /*!< FIR Coefficient Register16                   */
  __IO uint32_t COEF17;            /*!< FIR Coefficient Register17                   */
  __IO uint32_t COEF18;            /*!< FIR Coefficient Register18                   */
  __IO uint32_t COEF19;            /*!< FIR Coefficient Register19                   */
  __IO uint32_t COEF20;            /*!< FIR Coefficient Register20                   */
  __IO uint32_t COEF21;            /*!< FIR Coefficient Register21                   */
  __IO uint32_t COEF22;            /*!< FIR Coefficient Register22                   */
  __IO uint32_t COEF23;            /*!< FIR Coefficient Register23                   */
  __IO uint32_t COEF24;            /*!< FIR Coefficient Register24                   */
  __IO uint32_t COEF25;            /*!< FIR Coefficient Register25                   */
  __IO uint32_t COEF26;            /*!< FIR Coefficient Register26                   */
  __IO uint32_t COEF27;            /*!< FIR Coefficient Register27                   */
  __IO uint32_t COEF28;            /*!< FIR Coefficient Register28                   */
  __IO uint32_t COEF29;            /*!< FIR Coefficient Register29                   */
  __IO uint32_t COEF30;            /*!< FIR Coefficient Register30                   */
  __IO uint32_t COEF31;            /*!< FIR Coefficient Register31                   */
  __IO uint32_t COEF32;            /*!< FIR Coefficient Register32                   */
  __IO uint32_t COEF33;            /*!< FIR Coefficient Register33                   */
  __IO uint32_t COEF34;            /*!< FIR Coefficient Register34                   */
  __IO uint32_t COEF35;            /*!< FIR Coefficient Register35                   */
  __IO uint32_t COEF36;            /*!< FIR Coefficient Register36                   */
  __IO uint32_t COEF37;            /*!< FIR Coefficient Register37                   */
  __IO uint32_t COEF38;            /*!< FIR Coefficient Register38                   */
  __IO uint32_t COEF39;            /*!< FIR Coefficient Register39                   */
  __IO uint32_t COEF40;            /*!< FIR Coefficient Register40                   */
  __IO uint32_t COEF41;            /*!< FIR Coefficient Register41                   */
  __IO uint32_t COEF42;            /*!< FIR Coefficient Register42                   */
  __IO uint32_t COEF43;            /*!< FIR Coefficient Register43                   */
  __IO uint32_t COEF44;            /*!< FIR Coefficient Register44                   */
  __IO uint32_t COEF45;            /*!< FIR Coefficient Register45                   */
  __IO uint32_t COEF46;            /*!< FIR Coefficient Register46                   */
  __IO uint32_t COEF47;            /*!< FIR Coefficient Register47                   */
  __IO uint32_t COEF48;            /*!< FIR Coefficient Register48                   */
  __IO uint32_t COEF49;            /*!< FIR Coefficient Register49                   */
  __IO uint32_t COEF50;            /*!< FIR Coefficient Register50                   */
  __IO uint32_t COEF51;            /*!< FIR Coefficient Register51                   */
  __IO uint32_t COEF52;            /*!< FIR Coefficient Register52                   */
  __IO uint32_t COEF53;            /*!< FIR Coefficient Register53                   */
  __IO uint32_t COEF54;            /*!< FIR Coefficient Register54                   */
  __IO uint32_t COEF55;            /*!< FIR Coefficient Register55                   */
  __IO uint32_t COEF56;            /*!< FIR Coefficient Register56                   */
  __IO uint32_t COEF57;            /*!< FIR Coefficient Register57                   */
  __IO uint32_t COEF58;            /*!< FIR Coefficient Register58                   */
  __IO uint32_t COEF59;            /*!< FIR Coefficient Register59                   */
  __IO uint32_t COEF60;            /*!< FIR Coefficient Register60                   */
  __IO uint32_t COEF61;            /*!< FIR Coefficient Register61                   */
  __IO uint32_t COEF62;            /*!< FIR Coefficient Register62                   */
  __IO uint32_t COEF63;            /*!< FIR Coefficient Register63                   */
  __IO uint32_t COEF64;            /*!< FIR Coefficient Register64                   */
  __IO uint32_t COEF65;            /*!< FIR Coefficient Register65                   */
  __IO uint32_t COEF66;            /*!< FIR Coefficient Register66                   */
  __IO uint32_t COEF67;            /*!< FIR Coefficient Register67                   */
  __IO uint32_t COEF68;            /*!< FIR Coefficient Register68                   */
  __IO uint32_t COEF69;            /*!< FIR Coefficient Register69                   */
  __IO uint32_t COEF70;            /*!< FIR Coefficient Register70                   */
  __IO uint32_t COEF71;            /*!< FIR Coefficient Register71                   */
  __IO uint32_t COEF72;            /*!< FIR Coefficient Register72                   */
  __IO uint32_t COEF73;            /*!< FIR Coefficient Register73                   */
  __IO uint32_t COEF74;            /*!< FIR Coefficient Register74                   */
  __IO uint32_t COEF75;            /*!< FIR Coefficient Register75                   */
  __IO uint32_t COEF76;            /*!< FIR Coefficient Register76                   */
  __IO uint32_t COEF77;            /*!< FIR Coefficient Register77                   */
  __IO uint32_t COEF78;            /*!< FIR Coefficient Register78                   */
  __IO uint32_t COEF79;            /*!< FIR Coefficient Register79                   */
  __IO uint32_t COEF80;            /*!< FIR Coefficient Register80                   */
  __IO uint32_t COEF81;            /*!< FIR Coefficient Register81                   */
  __IO uint32_t COEF82;            /*!< FIR Coefficient Register82                   */
  __IO uint32_t COEF83;            /*!< FIR Coefficient Register83                   */
  __IO uint32_t COEF84;            /*!< FIR Coefficient Register84                   */
  __IO uint32_t COEF85;            /*!< FIR Coefficient Register85                   */
  __IO uint32_t COEF86;            /*!< FIR Coefficient Register86                   */
  __IO uint32_t COEF87;            /*!< FIR Coefficient Register87                   */
  __IO uint32_t COEF88;            /*!< FIR Coefficient Register88                   */
  __IO uint32_t COEF89;            /*!< FIR Coefficient Register89                   */
  __IO uint32_t COEF90;            /*!< FIR Coefficient Register90                   */
  __IO uint32_t COEF91;            /*!< FIR Coefficient Register91                   */
  __IO uint32_t COEF92;            /*!< FIR Coefficient Register92                   */
  __IO uint32_t COEF93;            /*!< FIR Coefficient Register93                   */
  __IO uint32_t COEF94;            /*!< FIR Coefficient Register94                   */
  __IO uint32_t COEF95;            /*!< FIR Coefficient Register95                   */
  __IO uint32_t COEF96;            /*!< FIR Coefficient Register96                   */
  __IO uint32_t COEF97;            /*!< FIR Coefficient Register97                   */
  __IO uint32_t COEF98;            /*!< FIR Coefficient Register98                   */
  __IO uint32_t COEF99;            /*!< FIR Coefficient Register99                   */
  __IO uint32_t COEF100;           /*!< FIR Coefficient Register100                  */
  __IO uint32_t COEF101;           /*!< FIR Coefficient Register101                  */
  __IO uint32_t COEF102;           /*!< FIR Coefficient Register102                  */
  __IO uint32_t COEF103;           /*!< FIR Coefficient Register103                  */
  __IO uint32_t COEF104;           /*!< FIR Coefficient Register104                  */
  __IO uint32_t COEF105;           /*!< FIR Coefficient Register105                  */
  __IO uint32_t COEF106;           /*!< FIR Coefficient Register106                  */
  __IO uint32_t COEF107;           /*!< FIR Coefficient Register107                  */
  __IO uint32_t COEF108;           /*!< FIR Coefficient Register108                  */
  __IO uint32_t COEF109;           /*!< FIR Coefficient Register109                  */
  __IO uint32_t COEF110;           /*!< FIR Coefficient Register110                  */
  __IO uint32_t COEF111;           /*!< FIR Coefficient Register111                  */
  __IO uint32_t COEF112;           /*!< FIR Coefficient Register112                  */
  __IO uint32_t COEF113;           /*!< FIR Coefficient Register113                  */
  __IO uint32_t COEF114;           /*!< FIR Coefficient Register114                  */
  __IO uint32_t COEF115;           /*!< FIR Coefficient Register115                  */
  __IO uint32_t COEF116;           /*!< FIR Coefficient Register116                  */
  __IO uint32_t COEF117;           /*!< FIR Coefficient Register117                  */
  __IO uint32_t COEF118;           /*!< FIR Coefficient Register118                  */
  __IO uint32_t COEF119;           /*!< FIR Coefficient Register119                  */
  __IO uint32_t COEF120;           /*!< FIR Coefficient Register120                  */
  __IO uint32_t COEF121;           /*!< FIR Coefficient Register121                  */
  __IO uint32_t COEF122;           /*!< FIR Coefficient Register122                  */
  __IO uint32_t COEF123;           /*!< FIR Coefficient Register123                  */
  __IO uint32_t COEF124;           /*!< FIR Coefficient Register124                  */
  __IO uint32_t COEF125;           /*!< FIR Coefficient Register125                  */
  __IO uint32_t COEF126;           /*!< FIR Coefficient Register126                  */
  __IO uint32_t COEF127;           /*!< FIR Coefficient Register127                  */
} TSB_FIR_TypeDef;

/**
  * @brief Port A
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port A Data Register                         */
  __IO uint32_t CR;                /*!< Port A Output Control Register               */
  __IO uint32_t FR1;               /*!< Port A Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port A Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port A Function Register 3                   */
       uint32_t RESERVED0;
  __IO uint32_t FR5;               /*!< Port A Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port A Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port A Function Register 7                   */
       uint32_t RESERVED1;
  __IO uint32_t OD;                /*!< Port A Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port A Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port A Pull-down Control Register            */
       uint32_t RESERVED2;
  __IO uint32_t IE;                /*!< Port A Input Control Register                */
} TSB_PA_TypeDef;

/**
  * @brief Port B
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port B Data Register                         */
  __IO uint32_t CR;                /*!< Port B Output Control Register               */
  __IO uint32_t FR1;               /*!< Port B Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port B Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port B Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port B Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port B Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port B Function Register 6                   */
       uint32_t RESERVED0[2];
  __IO uint32_t OD;                /*!< Port B Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port B Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port B Pull-down Control Register            */
       uint32_t RESERVED1;
  __IO uint32_t IE;                /*!< Port B Input Control Register                */
} TSB_PB_TypeDef;

/**
  * @brief Port D
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port D Data Register                         */
  __IO uint32_t CR;                /*!< Port D Output Control Register               */
  __IO uint32_t FR1;               /*!< Port D Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port D Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port D Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port D Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port D Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port D Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port D Function Register 7                   */
  __IO uint32_t FR8;               /*!< Port D Function Register 8                   */
  __IO uint32_t OD;                /*!< Port D Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port D Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port D Pull-down Control Register            */
       uint32_t RESERVED0;
  __IO uint32_t IE;                /*!< Port D Input Control Register                */
} TSB_PD_TypeDef;

/**
  * @brief Port E
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port E Data Register                         */
  __IO uint32_t CR;                /*!< Port E Output Control Register               */
  __IO uint32_t FR1;               /*!< Port E Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port E Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port E Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port E Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port E Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port E Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port E Function Register 7                   */
  __IO uint32_t FR8;               /*!< Port E Function Register 8                   */
  __IO uint32_t OD;                /*!< Port E Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port E Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port E Pull-down Control Register            */
       uint32_t RESERVED0;
  __IO uint32_t IE;                /*!< Port E Input Control Register                */
} TSB_PE_TypeDef;

/**
  * @brief Port F
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port F Data Register                         */
  __IO uint32_t CR;                /*!< Port F Output Control Register               */
  __IO uint32_t FR1;               /*!< Port F Function Register 1                   */
       uint32_t RESERVED0[2];
  __IO uint32_t FR4;               /*!< Port F Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port F Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port F Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port F Function Register 7                   */
       uint32_t RESERVED1;
  __IO uint32_t OD;                /*!< Port F Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port F Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port F Pull-down Control Register            */
       uint32_t RESERVED2;
  __IO uint32_t IE;                /*!< Port F Input Control Register                */
} TSB_PF_TypeDef;

/**
  * @brief Port G
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port G Data Register                         */
  __IO uint32_t CR;                /*!< Port G Output Control Register               */
  __IO uint32_t FR1;               /*!< Port G Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port G Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port G Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port G Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port G Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port G Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port G Function Register 7                   */
       uint32_t RESERVED0;
  __IO uint32_t OD;                /*!< Port G Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port G Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port G Pull-down Control Register            */
       uint32_t RESERVED1;
  __IO uint32_t IE;                /*!< Port G Input Control Register                */
} TSB_PG_TypeDef;

/**
  * @brief Port H
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port H Data Register                         */
  __IO uint32_t CR;                /*!< Port H Output Control Register               */
  __IO uint32_t FR1;               /*!< Port H Function Register 1                   */
       uint32_t RESERVED0;
  __IO uint32_t FR3;               /*!< Port H Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port H Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port H Function Register 5                   */
       uint32_t RESERVED1[3];
  __IO uint32_t OD;                /*!< Port H Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port H Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port H Pull-down Control Register            */
       uint32_t RESERVED2;
  __IO uint32_t IE;                /*!< Port H Input Control Register                */
} TSB_PH_TypeDef;

/**
  * @brief Port K
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port K Data Register                         */
  __IO uint32_t CR;                /*!< Port K Output Control Register               */
  __IO uint32_t FR1;               /*!< Port K Function Register 1                   */
  __IO uint32_t FR2;               /*!< Port K Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port K Function Register 3                   */
  __IO uint32_t FR4;               /*!< Port K Function Register 4                   */
  __IO uint32_t FR5;               /*!< Port K Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port K Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port K Function Register 7                   */
       uint32_t RESERVED0;
  __IO uint32_t OD;                /*!< Port K Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port K Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port K Pull-up Control Register              */
       uint32_t RESERVED1;
  __IO uint32_t IE;                /*!< Port K Input Control Register                */
} TSB_PK_TypeDef;

/**
  * @brief Port L
  */
typedef struct
{
  __IO uint32_t DATA;              /*!< Port L Data Register                         */
  __IO uint32_t CR;                /*!< Port L Output Control Register               */
       uint32_t RESERVED0;
  __IO uint32_t FR2;               /*!< Port L Function Register 2                   */
  __IO uint32_t FR3;               /*!< Port L Function Register 3                   */
       uint32_t RESERVED1;
  __IO uint32_t FR5;               /*!< Port L Function Register 5                   */
  __IO uint32_t FR6;               /*!< Port L Function Register 6                   */
  __IO uint32_t FR7;               /*!< Port L Function Register 7                   */
       uint32_t RESERVED2;
  __IO uint32_t OD;                /*!< Port L Open Drain Control Register           */
  __IO uint32_t PUP;               /*!< Port L Pull-up Control Register              */
  __IO uint32_t PDN;               /*!< Port L Pull-down Control Register            */
       uint32_t RESERVED3;
  __IO uint32_t IE;                /*!< Port L Input Control Register                */
} TSB_PL_TypeDef;

